require('keys/alias')

-- Назначает дополнительной клавишей для отключения режима Ctrl + K
-- im('<C-k>', '<escape>')

-- Сохранение по CTRL-s , как в нормальном, так и в insert режиме
nm('<C-s>', ':w<CR>')
im('<C-s>', '<esc>:w<CR>')

-- Переключение вкладок с помощью TAB или shift-tab (akinsho/bufferline.nvim)
nm('<Tab>', ':BufferLineCycleNext<CR>')
nm('<S-Tab>', ':BufferLineCyclePrev<CR>')

-----------------------------------------------------------
-- Фн. клавиши по F1 .. F12
-----------------------------------------------------------
-- По F1 очищаем последний поиск с подсветкой
nm('<F1>', ':nohl<CR>')
-- shift + F1 = удалить пустые строки
nm('<S-F1>', ':g/^$/d<CR>')
